results/single/restify.10000.100.txt
ab -n 10000 -c 100 -s 120 http://localhost:3000/
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /
Document Length:        16 bytes

Concurrency Level:      100
Time taken for tests:   3.807 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1430000 bytes
HTML transferred:       160000 bytes
Requests per second:    2626.75 [#/sec] (mean)
Time per request:       38.070 [ms] (mean)
Time per request:       0.381 [ms] (mean, across all concurrent requests)
Transfer rate:          366.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.4      0     196
Processing:     7   37  22.0     30     224
Waiting:        7   37  21.7     30     224
Total:         12   38  21.9     32     225

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     42
  75%     49
  80%     52
  90%     58
  95%     59
  98%     64
  99%    200
 100%    225 (longest request)